sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
    ((EventCode=1 process_name="rundll32.exe" CommandLine="*comsvcs*" CommandLine="*MiniDump*")
     OR (EventCode=1 CommandLine="*lsass*" (CommandLine="*MiniDump*" OR CommandLine="*procdump*"))
     OR (EventCode=11 file_name="*.dmp"))
| stats values(EventCode) AS events, values(CommandLine) AS dump_command,
        values(file_name) AS dropped_file, min(_time) AS first_seen by host, user
| sort - first_seen
